cmsis-svd/cmsis-svd/data/Fujitsu/MB9BF32xT.svd
        <!-- REGISTER "WFG_WFSA54" -->
        <register derivedFrom="WFG_WFSA10">
          <name>WFG_WFSA54</name>
          <description>WFG ch.54 Control Register A</description>
          <addressOffset>0x94</addressOffset>
        </register>
        <!-- REGISTER "WFG_WFTM10" -->
        <register>
          <name>WFG_WFTM10</name>
          <description>WFG ch.10 Timer Value Register</description>
          <addressOffset>0x80</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <!-- REGISTER "WFG_WFTM32" -->
        <register derivedFrom="WFG_WFTM10">
          <name>WFG_WFTM32</name>
          <description>WFG ch.32 Timer Value Register</description>
          <addressOffset>0x84</addressOffset>
        </register>
        <!-- REGISTER "WFG_WFTM54" -->
        <register derivedFrom="WFG_WFTM10">
          <name>WFG_WFTM54</name>
          <description>WFG ch.54 Timer Value Register</description>
          <addressOffset>0x88</addressOffset>
        </register>
        <!-- REGISTER "WFG_NZCL" -->
        <register>
          <name>WFG_NZCL</name>
          <description>NZCL Control Register</description>
          <addressOffset>0x9C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x001F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DTIE" -->
            <field>
              <name>DTIE</name>
              <description>DTIF interrupt enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "NWS" -->
            <field>
              <name>NWS</name>
              <description>noise-canceling width of the noise-canceller for the DTTIX pin</description>
              <lsb>1</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SDTI" -->
            <field>
              <name>SDTI</name>
              <description>Forcibly generates DTIF interrupt</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WFG_WFIR" -->
        <register>
          <name>WFG_WFIR</name>
          <description>WFG Interrupt Control Register</description>
          <addressOffset>0x98</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFF3</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DTIF" -->
            <field>
              <name>DTIF</name>
              <description>Indicates that DTIF interrupt has been generated.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "DTIC" -->
            <field>
              <name>DTIC</name>
              <description>Clears WFIR.DTIF and deasserts the DTIF interrupt signal.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "TMIF10" -->
            <field>
              <name>TMIF10</name>
              <description>Indicates that WFG10 timer interrupt has been generated.</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TMIC10" -->
            <field>
              <name>TMIC10</name>
              <description>Clears WFIR.TMIF10 and deasserts the WFG10 timer interrupt signal.</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "TMIE10" -->
            <field>
              <name>TMIE10</name>
              <description>Starts the WFG10 timer</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TMIS10" -->
            <field>
              <name>TMIS10</name>
              <description>Stops the WFG10 timer</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "TMIF32" -->
            <field>
              <name>TMIF32</name>
              <description>Indicates that WFG32 timer interrupt has been generated.</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TMIC32" -->
            <field>
              <name>TMIC32</name>
              <description>Clears WFIR.TMIF32 and deasserts the WFG32 timer interrupt signal.</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "TMIE32" -->
            <field>
              <name>TMIE32</name>
              <description>Starts the WFG32 timer</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TMIS32" -->
            <field>
              <name>TMIS32</name>
              <description>Stops the WFG32 timer</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "TMIF54" -->
            <field>
              <name>TMIF54</name>
              <description>Indicates that WFG54 timer interrupt has been generated.</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TMIC54" -->
            <field>
              <name>TMIC54</name>
              <description>Clears WFIR.TMIF54 and deasserts the WFG54 timer interrupt signal.</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "TMIE54" -->
            <field>
              <name>TMIE54</name>
              <description>Starts the WFG54 timer</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TMIS54" -->
            <field>
              <name>TMIS54</name>
              <description>Stops the WFG54 timer</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ICU_ICFS10" -->
        <register>
          <name>ICU_ICFS10</name>
          <description>"ICU ch.1,0 Connecting FRT Select Register"</description>
          <addressOffset>0x60</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "FSI0" -->
            <field>
              <name>FSI0</name>
              <description>Connects FRT ch.x to ICU ch.(0)</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FSI1" -->
            <field>
              <name>FSI1</name>
              <description>Connects FRT ch.x to ICU ch.(1)</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
